# Используем официальный образ Golang в качестве базового образа
FROM golang:1.17-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем go.mod и go.sum и загружаем зависимости
COPY go.mod go.sum ./
RUN go mod download

# Копируем все файлы из текущего каталога хоста в рабочую директорию внутри контейнера
COPY . .

# Собираем приложение
RUN CGO_ENABLED=0 GOOS=linux go build -o myapp

# Указываем порт, который будет слушать приложение
EXPOSE 8080
EXPOSE 3000

# Команда для запуска вашего приложения при старте контейнера
CMD ["./cmd/server/app.go"]
